LunchService/src/LunchReservation.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="lunchService" targetNamespace="http://j2ee.netbeans.org/wsdl/LunchService/lunchService"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/LunchService/lunchService" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns0="http://xml.netbeans.org/schema/Lunch">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/LunchService/lunchService">
            <xsd:import namespace="http://xml.netbeans.org/schema/Lunch" schemaLocation="Lunch.xsd"/>
        </xsd:schema>
    </types>
    <message name="lunchServiceOperationRequest">
        <part name="LunchBooking" type="ns0:LunchRequest"/>
    </message>
    <message name="lunchServiceOperationResponse"/>
    <portType name="lunchServicePortType">
        <operation name="lunchServiceOperation">
            <input name="input1" message="tns:lunchServiceOperationRequest"/>
            <output name="output1" message="tns:lunchServiceOperationResponse"/>
        </operation>
    </portType>
    <binding name="lunchServiceBinding" type="tns:lunchServicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="lunchServiceOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/LunchService/lunchService"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/LunchService/lunchService"/>
            </output>
        </operation>
    </binding>
    <service name="lunchServiceService">
        <port name="lunchServicePort" binding="tns:lunchServiceBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/lunchServiceService/lunchServicePort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="lunchService">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes.
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="lunchServicePortTypeRole" portType="tns:lunchServicePortType"/>
    </plnk:partnerLinkType>
</definitions>





